projects/writing/anime/2022_winter_pre/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-20 Thu 15:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5c08550">1. Winter 2022 Previews</a>
<ul>
<li><a href="#org007bd34">1.1. OP</a></li>
<li><a href="#org0e59147">1.2. The bright, refreshing Oreo Golden Sandwich Cookies, Lemon Flavored Creme.</a>
<ul>
<li><a href="#org9ae34e1">1.2.1. Sabikui Bisco</a></li>
<li><a href="#orga6f3977">1.2.2. Akebi-chan no Sailor-fuku</a></li>
<li><a href="#orgd43e4e6">1.2.3. Sono Bisque Doll wa Koi wo Suru</a></li>
<li><a href="#orgfd2e913">1.2.4. Tokyo 24-ku</a></li>
</ul>
</li>
<li><a href="#org7c6d8ac">1.3. These cookies hide their light under a bushel. White Fudge Covered Oreo Sandwich Cookies, Holiday Edition:</a>
<ul>
<li><a href="#org434ca4f">1.3.1. Koroshi Ai</a></li>
<li><a href="#orgfdc7c16">1.3.2. Eien no 831</a></li>
<li><a href="#orgeb3b055">1.3.3. Ryman's Club</a></li>
</ul>
</li>
<li><a href="#org96823f4">1.4. The classics. Oreo Caramel Flavored Creme Chocolate Sandwich Cookies:</a>
<ul>
<li><a href="#org54cd672">1.4.1. Kimetsu no Yaiba: Yuukaku hen</a></li>
<li><a href="#orga51b394">1.4.2. Genjitsu Shugi Yuusha no Oukoku Saikenki Part 2</a></li>
<li><a href="#org4d9bf87">1.4.3. Ousama Ranking</a></li>
<li><a href="#org0ec251a">1.4.4. Vanitas no Carte 2nd Cour</a></li>
</ul>
</li>
<li><a href="#org93201c2">1.5. Why do these exist? Oreo Chocolate Sandwich Cookies, Birthday Cake Flavored Creme.</a>
<ul>
<li><a href="#org88847e9">1.5.1. Tensai Ouji no Akaji Kokka Saisei Jutsu</a></li>
<li><a href="#orge2e1c4e">1.5.2. Kaijin Kaihatsu-bu no Kuroitsu-san</a></li>
<li><a href="#org621baee">1.5.3. Baraou no Souretsu</a></li>
<li><a href="#org94b7bc9">1.5.4. Tribe Nine</a></li>
</ul>
</li>
<li><a href="#org24ce65b">1.6. ED</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5c08550" class="outline-2">
<h2 id="org5c08550"><span class="section-number-2">1</span> Winter 2022 Previews</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org007bd34" class="outline-3">
<h3 id="org007bd34"><span class="section-number-3">1.1</span> OP</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Owdy,
</p>

<p>
In keeping with last season's easy to understand analogy to theme park height restrictions, this time I am sorting my anime thoughts according to the next most logical schema. Oreo flavors.
</p>
</div>
</div>

<div id="outline-container-org0e59147" class="outline-3">
<h3 id="org0e59147"><span class="section-number-3">1.2</span> The bright, refreshing Oreo Golden Sandwich Cookies, Lemon Flavored Creme.</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The hope of the lemon and the sheen of the gold come together to make my mouth water (the perfect level of moisture for anime consumption). The only drawback is the lack of chocolate:
</p>
</div>
<div id="outline-container-org9ae34e1" class="outline-4">
<h4 id="org9ae34e1"><span class="section-number-4">1.2.1</span> Sabikui Bisco</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
I'm psyched for the shonen anime about rust.
</p>

<p>
The scriptwriter (Murai Sadayuki) has worked a lot of projects I like (Satoshi Kon films like Perfect Blue and Millenium Actress, and shows like Kino no Tabi) as well as adapting series I like but have not watched (the anime Blame!, Sidonia no Kishi and Natsume Yuujinchou), so I'm curious to see how it turns out.
</p>
</div>
</div>

<div id="outline-container-orga6f3977" class="outline-4">
<h4 id="orga6f3977"><span class="section-number-4">1.2.2</span> Akebi-chan no Sailor-fuku</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
There was a lot of neat character animation in the first promo, so I'm definitely checking this out. I've read the first couple chapters of the manga, and it seems like a sweeter slice-of-life (but with a bunch of ecchi shots of high school girls which I did not catch in the promos. It's somewhat hard for me to imagine that an anime would be less ecchi than its source material).
</p>

<p>
The art directors worked on Horimiya (which had a similar, dramatically sunlit vibe). And I'm curious to see what the character designer/animation director (Kouno Megumi) will do, having worked on some fun projects as a character designer (FGO: Absolute Demonic Front) and more as an animator (Shigatsu wa Kimi no Uso, Spacy Dandy, Kill la Kill, &#x2026;).
</p>
</div>
</div>

<div id="outline-container-orgd43e4e6" class="outline-4">
<h4 id="orgd43e4e6"><span class="section-number-4">1.2.3</span> Sono Bisque Doll wa Koi wo Suru</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Another sweet, ecchi adaptation. And if the animation quality drops I'll drop it, 'cause to me the direction and character designs were unappealing (compared to the manga) during portions of the promos.
</p>

<p>
The director (Shinohara Keisuke) is a bit of a mystery to me. They've worked on some stuff I really liked (Devilman: Crybaby, Wonder Egg Priority, Flip Flappers) but the only thing they've fully directed and I've watched was Black Fox (which admittedly had fun animation, but ultimately wasn't entertaining).
</p>
</div>
</div>

<div id="outline-container-orgfd2e913" class="outline-4">
<h4 id="orgfd2e913"><span class="section-number-4">1.2.4</span> Tokyo 24-ku</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
The third CloverWorks anime on my list. At this point, I'm hoping that one gets delayed a la Wonder Egg Priority, rather than having the quality drop for one or more of these. (Note: After writing this, it seems like this might be the odd one out of the bunch). The first promo makes this seem like a Minority Report update (with the police force in this world trying to preempt crime).
</p>

<p>
This will probably mean more to you, but the director (Tsuda Naokatsu) was part of the directorial group in JoJo parts 1, 3-5. I'm more intrigued by the script writer (Shimokura Vio) having worked on Puella Magi Madoka Magica and Steins;Gate and character designer (Takahiro Kishida) having done visually similar stuff for Haikyuu!, Durarara!!, and Baccano!).
</p>
</div>
</div>
</div>

<div id="outline-container-org7c6d8ac" class="outline-3">
<h3 id="org7c6d8ac"><span class="section-number-3">1.3</span> These cookies hide their light under a bushel. White Fudge Covered Oreo Sandwich Cookies, Holiday Edition:</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org434ca4f" class="outline-4">
<h4 id="org434ca4f"><span class="section-number-4">1.3.1</span> Koroshi Ai</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
The promotional videos look like a mix between a generic setup (amnesia and a lost family) and an interesting love story/mystery. I'm going to check this out in part because it seems like a shoujo/josei action story and I'm curious to see what that looks like.
</p>

<p>
Most of the staff seem closely tied to projects by this studio (Platinum Vision), whose work I've not watched so I'm worried that the animation quality will be erratic.
</p>
</div>
</div>

<div id="outline-container-orgfdc7c16" class="outline-4">
<h4 id="orgfdc7c16"><span class="section-number-4">1.3.2</span> Eien no 831</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
This is just a single episode thing, but its directed and written by the director/writer of Higashi no Eden (along with other stuff that seems good but I've not watched).
</p>
</div>
</div>

<div id="outline-container-orgeb3b055" class="outline-4">
<h4 id="orgeb3b055"><span class="section-number-4">1.3.3</span> Ryman's Club</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
A sports show about adults seems neat, and the animation in the promo looked solid. I'd be surprised if the animation quality didn't drop at some point, so having characters working through more adult problems could be a fun diversion. The promo only highlighted a traumatic experience with a former teammate and meeting an enthusiastic new teammate, which both seem generic as it gets, but hopefully that's just the setup.
</p>

<p>
Plus, the character designer (Yasuda Suzuhito) is behind the designs for Durarara!! and the art director (Kai Masatoshi) has done some interesting urban designs before (Ao no Exorcist and Subete ga F ni Naru).
</p>
</div>
</div>
</div>

<div id="outline-container-org96823f4" class="outline-3">
<h3 id="org96823f4"><span class="section-number-3">1.4</span> The classics. Oreo Caramel Flavored Creme Chocolate Sandwich Cookies:</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org54cd672" class="outline-4">
<h4 id="org54cd672"><span class="section-number-4">1.4.1</span> Kimetsu no Yaiba: Yuukaku hen</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Yay! More splish splash, swoosh slice action.
</p>
</div>
</div>

<div id="outline-container-orga51b394" class="outline-4">
<h4 id="orga51b394"><span class="section-number-4">1.4.2</span> Genjitsu Shugi Yuusha no Oukoku Saikenki Part 2</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Looking forward to the shift towards foreign policy (slash expanding Souma's pool of love interests still further).
</p>
</div>
</div>

<div id="outline-container-org4d9bf87" class="outline-4">
<h4 id="org4d9bf87"><span class="section-number-4">1.4.3</span> Ousama Ranking</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Yay! More Whish whoosh, smash smoosh action.
</p>
</div>
</div>

<div id="outline-container-org0ec251a" class="outline-4">
<h4 id="org0ec251a"><span class="section-number-4">1.4.4</span> Vanitas no Carte 2nd Cour</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Yay! More sip sop, suck sick action (in Paris).
</p>
</div>
</div>
</div>

<div id="outline-container-org93201c2" class="outline-3">
<h3 id="org93201c2"><span class="section-number-3">1.5</span> Why do these exist? Oreo Chocolate Sandwich Cookies, Birthday Cake Flavored Creme.</h3>
<div class="outline-text-3" id="text-1-5">
<p>
How would one's birthday be improved by the addition of these cookies? I only hope that someone has constructed an edible birthday robot and used these to cover its light sensors:
</p>
</div>
<div id="outline-container-org88847e9" class="outline-4">
<h4 id="org88847e9"><span class="section-number-4">1.5.1</span> Tensai Ouji no Akaji Kokka Saisei Jutsu</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
I get the feeling that watching this would be a lose-lose scenario for me. If it's better thean Genjitsu Shugi than I'll feel silly watching that. If it's worse, I'll be watching a bad show. I get that the main character is supposed to be "lazy" in this one, so maybe the shows will be sufficiently different. But I'll wait on this to see if folks like it.
</p>
</div>
</div>

<div id="outline-container-orge2e1c4e" class="outline-4">
<h4 id="orge2e1c4e"><span class="section-number-4">1.5.2</span> Kaijin Kaihatsu-bu no Kuroitsu-san</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
The setup (scientists in an evil organization) sounds funny, but the promo made it seem like more of a slapstick, ecchi show than I'd like. Add in that the director (Saitou Hisashi) and credit for series composition (Takayama Katsuhiko) have worked on a real mixed bag of shows, and I'll sit this one out.
</p>
</div>
</div>

<div id="outline-container-org621baee" class="outline-4">
<h4 id="org621baee"><span class="section-number-4">1.5.3</span> Baraou no Souretsu</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
I'm tempted to watch this if only because I'm doubtful that the manga will every get translated. But the promo seems so gropey and melodramatic that I can't buy into it.
</p>
</div>
</div>

<div id="outline-container-org94b7bc9" class="outline-4">
<h4 id="org94b7bc9"><span class="section-number-4">1.5.4</span> Tribe Nine</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
If I'm going to consume anything by the Danganronpa writer, I have the feeling I should complete the games first (or at least watch Akudama Drive).
</p>
</div>
</div>
</div>

<div id="outline-container-org24ce65b" class="outline-3">
<h3 id="org24ce65b"><span class="section-number-3">1.6</span> ED</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Ow-bye,
</p>

<p>
Eric
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Eric</p>
<p class="date">Created: 2023-04-20 Thu 15:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
